Tekla Open API Reference for Tekla Structures 2025
IEvents.ModelObjectNumbered Event
 The ModelObjectNumbered event is raised when model object is numbered.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
event Events.ModelObjectNumberedDelegate ModelObjectNumbered
Event ModelObjectNumbered As Events.ModelObjectNumberedDelegate
Value
Type: Tekla.Structures.Model.Events.ModelObjectNumberedDelegate
See Also
Reference
IEvents Interface
Tekla.Structures.Model Namespace